# FabricationNetworkChangeService Properties

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
FabricationNetworkChangeService Properties
FabricationNetworkChangeService Class See Also
---
The FabricationNetworkChangeService type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

# See Also
FabricationNetworkChangeService Class
Autodesk.Revit.DB.Fabrication Namespace